{
    "common": {
        "name": "alias-manager",
        "version": "1.0.1",
        "news": {
            "1.0.1": {
                "en": "Fixed alias read and alias write function not working, if containing quotation marks.",
                "de": "Problem, dass die Lese- und Schreibfunktion für Alias ​​nicht funktionierte, wenn Anführungszeichen enthalten waren - gefixt",
                "ru": "Исправлены функции чтения псевдонимов и записи псевдонимов, которые не работали, если они содержат кавычки.",
                "pt": "As funções de leitura e gravação de alias corrigidas não funcionavam, caso contivessem aspas.",
                "nl": "Vaste alias lezen en alias schrijffunctie niet werken, indien met aanhalingstekens.",
                "fr": "Correction des fonctions de lecture d'alias et d'écriture d'alias ne fonctionnant pas, si elles contiennent des guillemets.",
                "it": "Risolto il problema con la funzione di lettura alias e scrittura alias che non funzionava, se contenevano virgolette.",
                "es": "Se corrigió que la función de lectura de alias y escritura de alias no funcionara, si contenía comillas.",
                "pl": "Naprawiono niedziałającą funkcję odczytu aliasu i zapisu aliasu, jeśli zawierała cudzysłowy.",
                "zh-cn": "修复了别名读取和别名写入功能（如果包含引号）不起作用的问题。"
            },
            "1.0.0": {
                "en": "Updated dependencies, Removed bottom-border if used as tab.",
                "de": "Aktualisierte Abhängigkeiten, unterer Rand entfernt, wenn als Registerkarte verwendet.",
                "ru": "Обновлены зависимости, удалена нижняя граница, если используется как вкладка.",
                "pt": "Dependências atualizadas, borda inferior removida se usada como guia.",
                "nl": "Bijgewerkte afhankelijkheden, onderrand verwijderd indien gebruikt als tabblad.",
                "fr": "Dépendances mises à jour, bordure inférieure supprimée si elle est utilisée comme onglet.",
                "it": "Dipendenze aggiornate, bordo inferiore rimosso se utilizzato come scheda.",
                "es": "Dependencias actualizadas, Borde inferior eliminado si se usa como pestaña.",
                "pl": "Zaktualizowano zależności, usunięto dolną ramkę, jeśli jest używana jako karta.",
                "zh-cn": "更新了相关性，如果用作选项卡，则删除了底部边框。"
            },
            "0.1.3": {
                "en": "Changed admin tab to singleton mode.",
                "de": "Die Registerkarte \"Admin\" wurde in den Singleton-Modus geändert.",
                "ru": "Изменена вкладка администратора в одноэлементный режим.",
                "pt": "Alterada a guia admin para o modo singleton.",
                "nl": "Admin-tabblad gewijzigd in singleton-modus.",
                "fr": "On a changé l'onglet d'administration en mode singleton.",
                "it": "Modificata la scheda di amministrazione in modalità singleton.",
                "es": "Se cambió la pestaña de administración al modo singleton.",
                "pl": "Zmieniono zakładkę administratora na tryb singleton.",
                "zh-cn": "将管理标签更改为单例模式。"
            },
            "0.1.2": {
                "en": "Fixed link to admin tab, Added translations.",
                "de": "Link zur Registerkarte \"Admin\" behoben, Übersetzungen hinzugefügt.",
                "ru": "Исправлена ​​ссылка на вкладку администратора, добавлены переводы.",
                "pt": "Link corrigido para a guia admin, traduções adicionadas.",
                "nl": "Vaste link naar admin-tabblad, vertalingen toegevoegd.",
                "fr": "Lien fixe vers l'onglet d'administration, ajout de traductions.",
                "it": "Collegamento fisso alla scheda di amministrazione, traduzioni aggiunte.",
                "es": "Enlace fijo a la pestaña de administración, traducciones agregadas.",
                "pl": "Naprawiono link do zakładki administratora, Dodano tłumaczenia.",
                "zh-cn": "修复了指向“管理”标签的链接，添加了翻译。"
            },
            "0.1.1": {
                "en": "Added alias-manager as tab to the ioBroker side menu, Added list of aliases to main tab, Enhanced open all / close all function for collapsibles, Added translations.",
                "de": "Alias-Manager als Registerkarte zum ioBroker-Seitenmenü hinzugefügt, Liste der Aliase zur Hauptregisterkarte hinzugefügt, Erweiterte Funktion zum Öffnen / Schließen aller Funktionen für zusammenklappbare Elemente hinzugefügt, Übersetzungen hinzugefügt.",
                "ru": "Добавлен alias-manager как вкладка в боковое меню ioBroker, Добавлен список псевдонимов на главную вкладку, Улучшена функция открытия всех / закрытия всех для сворачиваемых файлов, Добавлены переводы.",
                "pt": "Adicionado o gerenciador de alias como guia ao menu lateral do ioBroker, lista de apelidos adicionada à guia principal, função de abrir / fechar tudo aprimorada para recolhíveis, traduções adicionadas.",
                "nl": "Alias-manager toegevoegd als tabblad aan het ioBroker-zijmenu, lijst met aliassen toegevoegd aan het hoofdtabblad, Verbeterde functie Alles openen / sluiten voor samenvouwbare functies, Vertalingen toegevoegd.",
                "fr": "Ajout du gestionnaire d'alias en tant qu'onglet au menu latéral d'ioBroker, Ajout de la liste des alias à l'onglet principal, Amélioration de la fonction ouvrir tout / fermer tout pour les collapsibles, Ajout de traductions.",
                "it": "Aggiunto alias-manager come scheda al menu laterale di ioBroker, Aggiunto elenco di alias alla scheda principale, Migliorata la funzione apri tutto / chiudi tutto per i pieghevoli, Aggiunte traduzioni.",
                "es": "Se agregó un administrador de alias como pestaña al menú lateral de ioBroker, se agregó una lista de alias a la pestaña principal, se mejoró la función abrir todo / cerrar todo para plegables, se agregaron traducciones.",
                "pl": "Dodano menedżera aliasów jako zakładkę do menu bocznego ioBroker, Dodano listę aliasów do zakładki głównej, Ulepszono funkcję otwierania wszystkich / zamykania wszystkich dla collapsibles, Dodano tłumaczenia.",
                "zh-cn": "在ioBroker侧面菜单中添加了别名管理器作为选项卡，在主选项卡中添加了别名列表，增强了可折叠对象的全部打开/关闭所有功能，添加了翻译。"
            },
            "0.1.0": {
                "en": "Alias-ID can now be an object with seperate datapoints for read and write, Alias-Datapoints can now be collapsed, Added Autocreate Alias function.",
                "de": "Die Alias-ID kann jetzt ein Objekt mit separaten Datenpunkten zum Lesen und Schreiben sein. Alias-Datenpunkte können jetzt reduziert werden. Die Funktion \"Alias ​​automatisch erstellen\" wurde hinzugefügt.",
                "ru": "Alias-ID теперь может быть объектом с отдельными точками данных для чтения и записи, Alias-Datapoints теперь можно свернуть, добавлена ​​функция Autocreate Alias.",
                "pt": "Alias-ID agora pode ser um objeto com pontos de dados separados para leitura e gravação, Alias-Datapoints agora podem ser recolhidos, função Autocreate Alias ​​adicionada.",
                "nl": "Alias-ID kan nu een object zijn met aparte datapunten voor lezen en schrijven, Alias-datapunten kunnen nu worden samengevouwen, Autocreate Alias-functie toegevoegd.",
                "fr": "Alias-ID peut maintenant être un objet avec des points de données séparés pour la lecture et l'écriture, les points de données d'alias peuvent maintenant être réduits, Ajout de la fonction de création automatique d'alias.",
                "it": "Alias-ID può ora essere un oggetto con datapoint separati per lettura e scrittura, Alias-Datapoints ora possono essere compressi, Aggiunta funzione di creazione automatica alias.",
                "es": "Alias-ID ahora puede ser un objeto con puntos de datos separados para lectura y escritura, los Alias-Datapoints ahora se pueden contraer, se agregó la función Autocreate Alias.",
                "pl": "Alias-ID może być teraz obiektem z oddzielnymi punktami danych do odczytu i zapisu, Alias-Datapoints można teraz zwinąć, Dodano funkcję Autocreate Alias.",
                "zh-cn": "Alias-ID现在可以是具有用于读写的单独数据点的对象，Alias-Datapoints现在可以折叠，添加了自动创建别名功能。"
            },
            "0.0.8": {
                "en": "Added ability to create alias-datapoint from existing datapoint.",
                "de": "Es wurde die Möglichkeit hinzugefügt, einen Alias-Datenpunkt aus einem vorhandenen Datenpunkt zu erstellen.",
                "ru": "Добавлена ​​возможность создания псевдонима точки данных из существующей точки данных.",
                "pt": "Adicionada a capacidade de criar alias-datapoint a partir de datapoint existente.",
                "nl": "Mogelijkheid toegevoegd om een ​​alias-datapunt te maken op basis van een bestaand datapunt.",
                "fr": "Ajout de la possibilité de créer un alias-point de données à partir d'un point de données existant.",
                "it": "Aggiunta la possibilità di creare un alias-datapoint da un datapoint esistente.",
                "es": "Se agregó la capacidad de crear un alias-punto de datos a partir de un punto de datos existente.",
                "pl": "Dodano możliwość tworzenia aliasu-punktu danych z istniejącego punktu danych.",
                "zh-cn": "增加了从现有数据点创建别名数据点的功能。"
            },
            "0.0.7": {
                "en": "Fixed typos, Changed the way ioBroker-Objects are fetched (much faster), Added copy-button to datapoints, Empty fields are now removed (before they were set to null), Changed mode to onlyWWW.",
                "de": "Behobene Tippfehler, Geänderte Art und Weise, wie ioBroker-Objekte abgerufen werden (viel schneller), Kopierschaltfläche zu Datenpunkten hinzugefügt, Leere Felder werden jetzt entfernt (bevor sie auf Null gesetzt wurden), Geänderter Modus in Nur WWW.",
                "ru": "Исправлены опечатки, изменен способ получения объектов ioBroker-Objects (намного быстрее), добавлена ​​кнопка копирования для точек данных, пустые поля теперь удаляются (до того, как они были установлены на null), изменен режим на onlyWWW.",
                "pt": "Erros de digitação corrigidos, Alteração da forma como os objetos ioBroker são buscados (muito mais rápido), Botão de cópia adicionado aos pontos de dados, Campos vazios agora são removidos (antes de serem definidos como nulos), Modo alterado para onlyWWW.",
                "nl": "Typefouten opgelost, de manier gewijzigd waarop ioBroker-objecten worden opgehaald (veel sneller), kopieerknop toegevoegd aan datapunten, lege velden zijn nu verwijderd (voordat ze op nul werden gezet), modus gewijzigd in alleen WWW.",
                "fr": "Correction de fautes de frappe, Modification de la façon dont les objets ioBroker sont récupérés (beaucoup plus rapide), Ajout d'un bouton de copie aux points de données, Les champs vides sont maintenant supprimés (avant qu'ils ne soient définis sur null), Changement de mode en seulementWWW.",
                "it": "Errori di battitura corretti, Modificato il modo in cui gli oggetti ioBroker vengono recuperati (molto più velocemente), Aggiunto il pulsante di copia ai datapoint, I campi vuoti sono ora rimossi (prima che fossero impostati su null), Modificata la modalità a onlyWWW.",
                "es": "Se corrigieron errores tipográficos, se modificó la forma en que se obtienen los objetos ioBroker (mucho más rápido), se agregó un botón de copia a los puntos de datos, los campos vacíos ahora se eliminan (antes de que se establecieran en nulos), se cambió el modo a soloWWW.",
                "pl": "Poprawione literówki, Zmieniono sposób pobierania obiektów ioBroker (znacznie szybciej), Dodano przycisk kopiowania do punktów danych, Puste pola są teraz usuwane (zanim zostały ustawione na null), Zmieniono tryb na onlyWWW.",
                "zh-cn": "固定错别字，更改了ioBroker对象的获取方式（快得多），向数据点添加了复制按钮，现在删除了空字段（在将它们设置为null之前），将模式更改为onlyWWW。"
            },
            "0.0.6": {
                "en": "some fixes",
                "de": "einige Korrekturen",
                "ru": "некоторые исправления",
                "pt": "algumas correções",
                "nl": "enkele fixes",
                "fr": "quelques correctifs",
                "it": "alcune correzioni",
                "es": "algunas correcciones",
                "pl": "kilka poprawek",
                "zh-cn": "一些修复"
            },
            "0.0.5": {
                "en": "some fixes",
                "de": "einige Korrekturen",
                "ru": "некоторые исправления",
                "pt": "algumas correções",
                "nl": "enkele fixes",
                "fr": "quelques correctifs",
                "it": "alcune correzioni",
                "es": "algunas correcciones",
                "pl": "kilka poprawek",
                "zh-cn": "一些修复"
            },
            "0.0.4": {
                "en": "some fixes",
                "de": "einige Korrekturen",
                "ru": "некоторые исправления",
                "pt": "algumas correções",
                "nl": "enkele fixes",
                "fr": "quelques correctifs",
                "it": "alcune correzioni",
                "es": "algunas correcciones",
                "pl": "kilka poprawek",
                "zh-cn": "一些修复"
            },
            "0.0.3": {
                "en": "some fixes",
                "de": "einige Korrekturen",
                "ru": "некоторые исправления",
                "pt": "algumas correções",
                "nl": "enkele fixes",
                "fr": "quelques correctifs",
                "it": "alcune correzioni",
                "es": "algunas correcciones",
                "pl": "kilka poprawek",
                "zh-cn": "一些修复"
            },
            "0.0.2": {
                "en": "added conversion for min and max to type number",
                "de": "Konvertierung für min und max zur Typennummer hinzugefügt",
                "ru": "добавлено преобразование минимума и максимума в тип числа",
                "pt": "adição de conversão para mínimo e máximo ao tipo número",
                "nl": "conversie toegevoegd voor min en max naar typenummer",
                "fr": "conversion ajoutée pour min et max en nombre de type",
                "it": "aggiunta conversione per min e max in numero di tipo",
                "es": "conversión agregada para mínimo y máximo al número de tipo",
                "pl": "dodana konwersja dla min i max na numer typu",
                "zh-cn": "增加了最小和最大类型类型的转换"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "Alias-Manager",
        "titleLang": {
            "en": "Alias-Manager",
            "de": "Alias-Manager",
            "ru": "Алиас-менеджер",
            "pt": "Alias-Manager",
            "nl": "Alias-Manager",
            "fr": "Alias-Manager",
            "it": "Alias-manager",
            "es": "Gerente de alias",
            "pl": "Alias-Manager",
            "zh-cn": "别名经理"
        },
        "desc": {
            "en": "Manages and creates aliases",
            "de": "Verwaltet und erstellt Aliase",
            "ru": "Управляет и создает псевдонимы",
            "pt": "Gerencia e cria aliases",
            "nl": "Beheert en maakt aliassen",
            "fr": "Gère et crée des alias",
            "it": "Gestisce e crea alias",
            "es": "Administra y crea alias",
            "pl": "Zarządza i tworzy aliasy",
            "zh-cn": "管理和创建别名"
        },
        "authors": [
            "Sebastian Bormann <sebastian@bormann.net>"
        ],
        "keywords": [
            "Alias"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "alias-manager.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/sbormann/ioBroker.alias-manager/master/admin/alias-manager.png",
        "readme": "https://github.com/sbormann/ioBroker.alias-manager/blob/master/README.md",
        "loglevel": "info",
        "mode": "none",
        "type": "general",
        "highlight": true,
        "compact": true,
        "singleton": true,
        "materialize": true,
        "materializeTab": true,
        "adminTab": {
            "name": {
                "en": "Alias-Manager",
                "de": "Alias-Manager",
                "ru": "Alias-Manager",
                "pt": "Alias-Manager",
                "nl": "Alias-Manager",
                "fr": "Alias-Manager",
                "it": "Alias-Manager",
                "es": "Alias-Manager",
                "pl": "Alias-Manager",
                "zh-cn": "Alias-Manager"
            },
            "singleton": true,
            "fa-icon": "control_point_duplicate",
            "link": "/adapter/alias-manager/index_m.html"
        },
        "onlyWWW": true,
        "blockly": false,
        "messagebox": false,
        "subscribe": "",
        "noIntro": true,
        "supportCustoms": false,
        "connectionType": "local",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=1.4.2"
            }
        ]
    },
    "native": {},
    "objects": [],
    "instanceObjects": []
}